W8D1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Really?"], ["url", ""], ["content", "He could be hired to play the cameo."], ["author_id", 1], ["created_at", "2019-10-07 22:45:14.821509"], ["updated_at", "2019-10-07 22:45:14.821509"]]
---
    def  create
        # set up the author id directly is not good, instead
        # put it in the whitelist params and used the current_user.post
        # @post = Post.new(post_params)
        # @post.author_id = current_user.id

        @post = current_user.posts.new(post_params)

        if @post.save