W8D1/RedditClone/app/views/posts/_form.html.erb

SELECT "subs".* FROM "subs"
SELECT  1 AS one FROM "post_subs" WHERE "post_subs"."post_id" IS NULL AND "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 2], ["LIMIT", 1]]
---
    <input type="hidden" name="post[sub_ids][]" value="" >
    <% Sub.all.each do |sub| %>
      <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
        <%= post.sub_ids.include?(sub.id) ? "checked" : "" %>