W6D3/FirstController/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    #render plain: "I'm in the index action!"
    users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Miles"], ["email", "miles@aa.com"], ["created_at", "2019-09-25 22:23:10.427317"], ["updated_at", "2019-09-25 22:23:10.427317"]]
---
  def create
    # render json: params
    user = User.new(params.require(:user).permit(:name, :email))
    # replace the `user_attributes_here` with the actual attribute keys
    if user.save