W8D1/RedditClone/app/models/user.rb

    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "glMlsKMvYqcGs5WXQVITbA"], ["updated_at", "2019-10-07 18:40:58.849078"], ["id", 1]]